# RbsCurvetypePreferredBranchParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypePreferredBranchParam Property
ParameterTypeId Class See Also
---
"Preferred Junction Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypePreferredBranchParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypePreferredBranchParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypePreferredBranchParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace